codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024eff124.h
extern volatile __IPC19bits_t IPC19bits __asm__ ("IPC19") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC19CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC19SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC19INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC20 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCD21IS:2;
    unsigned ADCD21IP:3;
    unsigned :3;
    unsigned ADCD22IS:2;
    unsigned ADCD22IP:3;
    unsigned :3;
    unsigned ADCD23IS:2;
    unsigned ADCD23IP:3;
    unsigned :3;
    unsigned ADCD24IS:2;
    unsigned ADCD24IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC20bits_t;
extern volatile __IPC20bits_t IPC20bits __asm__ ("IPC20") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC20CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC20SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC20INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC21 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCD25IS:2;
    unsigned ADCD25IP:3;
    unsigned :3;
    unsigned ADCD26IS:2;
    unsigned ADCD26IP:3;
    unsigned :3;
    unsigned ADCD27IS:2;
    unsigned ADCD27IP:3;
    unsigned :3;
    unsigned ADCD28IS:2;
    unsigned ADCD28IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC21bits_t;
extern volatile __IPC21bits_t IPC21bits __asm__ ("IPC21") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC21CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC21SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC21INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC22 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCD29IS:2;
    unsigned ADCD29IP:3;
    unsigned :3;
    unsigned ADCD30IS:2;
    unsigned ADCD30IP:3;
    unsigned :3;
    unsigned ADCD31IS:2;
    unsigned ADCD31IP:3;
    unsigned :3;
    unsigned ADCD32IS:2;
    unsigned ADCD32IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC22bits_t;
extern volatile __IPC22bits_t IPC22bits __asm__ ("IPC22") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC22CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC22SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC22INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC23 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCD33IS:2;
    unsigned ADCD33IP:3;
    unsigned :3;
    unsigned ADCD34IS:2;
    unsigned ADCD34IP:3;
    unsigned :3;
    unsigned ADCD35IS:2;
    unsigned ADCD35IP:3;
    unsigned :3;
    unsigned ADCD36IS:2;
    unsigned ADCD36IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC23bits_t;
extern volatile __IPC23bits_t IPC23bits __asm__ ("IPC23") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC23CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC23SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC23INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC24 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCD37IS:2;
    unsigned ADCD37IP:3;
    unsigned :3;
    unsigned ADCD38IS:2;
    unsigned ADCD38IP:3;
    unsigned :3;
    unsigned ADCD39IS:2;
    unsigned ADCD39IP:3;
    unsigned :3;
    unsigned ADCD40IS:2;
    unsigned ADCD40IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC24bits_t;
extern volatile __IPC24bits_t IPC24bits __asm__ ("IPC24") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC24SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC24INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC25 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCD41IS:2;
    unsigned ADCD41IP:3;
    unsigned :3;
    unsigned ADCD42IS:2;
    unsigned ADCD42IP:3;
    unsigned :3;
    unsigned ADCD43IS:2;
    unsigned ADCD43IP:3;
    unsigned :3;
    unsigned ADCD44IS:2;
    unsigned ADCD44IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC25bits_t;
extern volatile __IPC25bits_t IPC25bits __asm__ ("IPC25") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC25SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC25INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC26 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CPCIS:2;
    unsigned CPCIP:3;
    unsigned :3;
    unsigned CFDCIS:2;
    unsigned CFDCIP:3;
    unsigned :3;
    unsigned SBIS:2;
    unsigned SBIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC26bits_t;
extern volatile __IPC26bits_t IPC26bits __asm__ ("IPC26") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC26SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC26INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC27 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :8;
    unsigned SPI1EIS:2;
    unsigned SPI1EIP:3;
    unsigned :3;
    unsigned SPI1RXIS:2;
    unsigned SPI1RXIP:3;
    unsigned :3;
    unsigned SPI1TXIS:2;
    unsigned SPI1TXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC27bits_t;
extern volatile __IPC27bits_t IPC27bits __asm__ ("IPC27") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC27SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC27INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC28 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned U1EIS:2;
    unsigned U1EIP:3;
    unsigned :3;
    unsigned U1RXIS:2;
    unsigned U1RXIP:3;
    unsigned :3;
    unsigned U1TXIS:2;
    unsigned U1TXIP:3;
    unsigned :3;
    unsigned I2C1BIS:2;
    unsigned I2C1BIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC28bits_t;
