codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024eff124.h
#define _DCH6DSA_CHDSA_POSITION                  0x00000000
#define _DCH6DSA_CHDSA_MASK                      0xFFFFFFFF
#define _DCH6DSA_CHDSA_LENGTH                    0x00000020

#define _DCH6SSIZ_CHSSIZ_POSITION                0x00000000
#define _DCH6SSIZ_CHSSIZ_MASK                    0x0000FFFF
#define _DCH6SSIZ_CHSSIZ_LENGTH                  0x00000010

#define _DCH6DSIZ_CHDSIZ_POSITION                0x00000000
#define _DCH6DSIZ_CHDSIZ_MASK                    0x0000FFFF
#define _DCH6DSIZ_CHDSIZ_LENGTH                  0x00000010

#define _DCH6SPTR_CHSPTR_POSITION                0x00000000
#define _DCH6SPTR_CHSPTR_MASK                    0x0000FFFF
#define _DCH6SPTR_CHSPTR_LENGTH                  0x00000010

#define _DCH6DPTR_CHDPTR_POSITION                0x00000000
#define _DCH6DPTR_CHDPTR_MASK                    0x0000FFFF
#define _DCH6DPTR_CHDPTR_LENGTH                  0x00000010

#define _DCH6CSIZ_CHCSIZ_POSITION                0x00000000
#define _DCH6CSIZ_CHCSIZ_MASK                    0x0000FFFF
#define _DCH6CSIZ_CHCSIZ_LENGTH                  0x00000010

#define _DCH6CPTR_CHCPTR_POSITION                0x00000000
#define _DCH6CPTR_CHCPTR_MASK                    0x0000FFFF
#define _DCH6CPTR_CHCPTR_LENGTH                  0x00000010

#define _DCS6CPTR_CHCPTR_POSITION                0x00000000
#define _DCS6CPTR_CHCPTR_MASK                    0x0000FFFF
#define _DCS6CPTR_CHCPTR_LENGTH                  0x00000010

#define _DCH6DAT_CHPDAT_POSITION                 0x00000000
#define _DCH6DAT_CHPDAT_MASK                     0x0000FFFF
#define _DCH6DAT_CHPDAT_LENGTH                   0x00000010

#define _DCH7CON_CHPRI_POSITION                  0x00000000
#define _DCH7CON_CHPRI_MASK                      0x00000003
#define _DCH7CON_CHPRI_LENGTH                    0x00000002

#define _DCH7CON_CHEDET_POSITION                 0x00000002
#define _DCH7CON_CHEDET_MASK                     0x00000004
#define _DCH7CON_CHEDET_LENGTH                   0x00000001

#define _DCH7CON_CHAEN_POSITION                  0x00000004
#define _DCH7CON_CHAEN_MASK                      0x00000010
#define _DCH7CON_CHAEN_LENGTH                    0x00000001

#define _DCH7CON_CHCHN_POSITION                  0x00000005
#define _DCH7CON_CHCHN_MASK                      0x00000020
#define _DCH7CON_CHCHN_LENGTH                    0x00000001

#define _DCH7CON_CHAED_POSITION                  0x00000006
#define _DCH7CON_CHAED_MASK                      0x00000040
#define _DCH7CON_CHAED_LENGTH                    0x00000001

#define _DCH7CON_CHEN_POSITION                   0x00000007
#define _DCH7CON_CHEN_MASK                       0x00000080
#define _DCH7CON_CHEN_LENGTH                     0x00000001

#define _DCH7CON_CHCHNS_POSITION                 0x00000008
#define _DCH7CON_CHCHNS_MASK                     0x00000100
#define _DCH7CON_CHCHNS_LENGTH                   0x00000001

#define _DCH7CON_CHPATLEN_POSITION               0x0000000B
#define _DCH7CON_CHPATLEN_MASK                   0x00000800
#define _DCH7CON_CHPATLEN_LENGTH                 0x00000001

#define _DCH7CON_CHPIGNEN_POSITION               0x0000000D
#define _DCH7CON_CHPIGNEN_MASK                   0x00002000
#define _DCH7CON_CHPIGNEN_LENGTH                 0x00000001

#define _DCH7CON_CHBUSY_POSITION                 0x0000000F
#define _DCH7CON_CHBUSY_MASK                     0x00008000
#define _DCH7CON_CHBUSY_LENGTH                   0x00000001

#define _DCH7CON_CHPIGN_POSITION                 0x00000018
#define _DCH7CON_CHPIGN_MASK                     0xFF000000
#define _DCH7CON_CHPIGN_LENGTH                   0x00000008

#define _DCH7ECON_AIRQEN_POSITION                0x00000003
#define _DCH7ECON_AIRQEN_MASK                    0x00000008
#define _DCH7ECON_AIRQEN_LENGTH                  0x00000001

#define _DCH7ECON_SIRQEN_POSITION                0x00000004
#define _DCH7ECON_SIRQEN_MASK                    0x00000010
#define _DCH7ECON_SIRQEN_LENGTH                  0x00000001

#define _DCH7ECON_PATEN_POSITION                 0x00000005
#define _DCH7ECON_PATEN_MASK                     0x00000020
#define _DCH7ECON_PATEN_LENGTH                   0x00000001

#define _DCH7ECON_CABORT_POSITION                0x00000006
#define _DCH7ECON_CABORT_MASK                    0x00000040
#define _DCH7ECON_CABORT_LENGTH                  0x00000001

#define _DCH7ECON_CFORCE_POSITION                0x00000007
#define _DCH7ECON_CFORCE_MASK                    0x00000080
#define _DCH7ECON_CFORCE_LENGTH                  0x00000001

#define _DCH7ECON_CHSIRQ_POSITION                0x00000008
#define _DCH7ECON_CHSIRQ_MASK                    0x0000FF00
#define _DCH7ECON_CHSIRQ_LENGTH                  0x00000008

#define _DCH7ECON_CHAIRQ_POSITION                0x00000010
#define _DCH7ECON_CHAIRQ_MASK                    0x00FF0000
#define _DCH7ECON_CHAIRQ_LENGTH                  0x00000008

#define _DCH7INT_CHERIF_POSITION                 0x00000000
#define _DCH7INT_CHERIF_MASK                     0x00000001
#define _DCH7INT_CHERIF_LENGTH                   0x00000001

#define _DCH7INT_CHTAIF_POSITION                 0x00000001
#define _DCH7INT_CHTAIF_MASK                     0x00000002
#define _DCH7INT_CHTAIF_LENGTH                   0x00000001

#define _DCH7INT_CHCCIF_POSITION                 0x00000002
#define _DCH7INT_CHCCIF_MASK                     0x00000004
#define _DCH7INT_CHCCIF_LENGTH                   0x00000001

#define _DCH7INT_CHBCIF_POSITION                 0x00000003
#define _DCH7INT_CHBCIF_MASK                     0x00000008
#define _DCH7INT_CHBCIF_LENGTH                   0x00000001

#define _DCH7INT_CHDHIF_POSITION                 0x00000004
#define _DCH7INT_CHDHIF_MASK                     0x00000010
#define _DCH7INT_CHDHIF_LENGTH                   0x00000001

#define _DCH7INT_CHDDIF_POSITION                 0x00000005
#define _DCH7INT_CHDDIF_MASK                     0x00000020
#define _DCH7INT_CHDDIF_LENGTH                   0x00000001

#define _DCH7INT_CHSHIF_POSITION                 0x00000006
#define _DCH7INT_CHSHIF_MASK                     0x00000040
#define _DCH7INT_CHSHIF_LENGTH                   0x00000001

#define _DCH7INT_CHSDIF_POSITION                 0x00000007
#define _DCH7INT_CHSDIF_MASK                     0x00000080
#define _DCH7INT_CHSDIF_LENGTH                   0x00000001

